In [2]:
import numpy as np
import pandas as pd

In [4]:
marks=pd.DataFrame({"mat":[99,95,np.nan],"sci":[98,95,100],"soc":[np.nan,95,np.nan]}) #creating a df with dict
marks

    mat  sci   soc
0  99.0   98   NaN
1  95.0   95  95.0
2   NaN  100   NaN

In [5]:
marks.info() # get to know the df in detail

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mat     2 non-null      float64
 1   sci     3 non-null      int64
 2   soc     1 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 200.0 bytes

In [6]:
marks.isnull() #checks whether any null values present or not if ye prints true in place of value

     mat    sci    soc
0  False  False   True
1  False  False  False
2   True  False   True

In [7]:
marks.isna()#checks whether any null values present or not if yes prints true in place of value

     mat    sci    soc
0  False  False   True
1  False  False  False
2   True  False   True

In [9]:
marks.dropna() #drops null value rows

    mat  sci   soc
1  95.0   95  95.0

In [10]:
marks.dropna(axis=1) # drops null value columns

   sci
0   98
1   95
2  100

In [11]:
marks.dropna(thresh=1) # thres prints atleast 1 non nan value rows

    mat  sci   soc
0  99.0   98   NaN
1  95.0   95  95.0
2   NaN  100   NaN

In [12]:
marks.dropna(thresh=2) #thres prints atleast 2 non nan value rows

    mat  sci   soc
0  99.0   98   NaN
1  95.0   95  95.0

In [13]:
marks.dropna(thresh=1,axis=1)  # thres prints atleast 1 non nan value column

    mat  sci   soc
0  99.0   98   NaN
1  95.0   95  95.0
2   NaN  100   NaN

In [14]:
marks.dropna(thresh=2,axis=1) # thres prints atleast 2 non nan value column

    mat  sci
0  99.0   98
1  95.0   95
2   NaN  100

In [15]:
marks.dropna(thresh=3) #thres prints atleast 3 non nan value rows

    mat  sci   soc
1  95.0   95  95.0

In [19]:
marks.dropna(thresh=3,axis=1) # thres prints atleast 3 non nan value column

   sci
0   98
1   95
2  100

In [20]:
marks

    mat  sci   soc
0  99.0   98   NaN
1  95.0   95  95.0
2   NaN  100   NaN

In [22]:
marks.fillna(value='Default') #filling na values by default value

       mat  sci      soc
0       99   98  Default
1       95   95       95
2  Default  100  Default

In [23]:
marks.fillna(value=100) # filling na values by using int value

     mat  sci    soc
0   99.0   98  100.0
1   95.0   95   95.0
2  100.0  100  100.0

In [24]:
marks

    mat  sci   soc
0  99.0   98   NaN
1  95.0   95  95.0
2   NaN  100   NaN

In [25]:
marks['mat'].fillna(value='Default') # filling first column or mat column with a value default

0         99
1         95
2    Default
Name: mat, dtype: object

In [26]:
marks

    mat  sci   soc
0  99.0   98   NaN
1  95.0   95  95.0
2   NaN  100   NaN

In [27]:
marks.fillna(method='pad')

    mat  sci   soc
0  99.0   98   NaN
1  95.0   95  95.0
2  95.0  100  95.0

In [28]:
marks.fillna(method='bfill')

    mat  sci   soc
0  99.0   98  95.0
1  95.0   95  95.0
2   NaN  100   NaN

In [29]:
marks

    mat  sci   soc
0  99.0   98   NaN
1  95.0   95  95.0
2   NaN  100   NaN

In [31]:
marks['mat'].fillna(value=marks['mat'].mean()) # filling first or mat column nan values with mean value

0    99.0
1    95.0
2    97.0
Name: mat, dtype: float64

In [32]:
marks['soc'].fillna(value=marks['soc'].median()) #filling soc column nan values with median value

0    95.0
1    95.0
2    95.0
Name: soc, dtype: float64

In [35]:
marks['soc'].fillna(value=marks['soc'].mode())#filling soc column nan values with mode value

0    95.0
1    95.0
2     NaN
Name: soc, dtype: float64

In [36]:
marks.describe() # describe will gives you box plot parameters

             mat         sci   soc
count   2.000000    3.000000   1.0
mean   97.000000   97.666667  95.0
std     2.828427    2.516611   NaN
min    95.000000   95.000000  95.0
25%    96.000000   96.500000  95.0
50%    97.000000   98.000000  95.0
75%    98.000000   99.000000  95.0
max    99.000000  100.000000  95.0

In [37]:
marks

    mat  sci   soc
0  99.0   98   NaN
1  95.0   95  95.0
2   NaN  100   NaN

In [39]:
marks.head() # first five rows

    mat  sci   soc
0  99.0   98   NaN
1  95.0   95  95.0
2   NaN  100   NaN

In [40]:
marks.tail() #last five rows

    mat  sci   soc
0  99.0   98   NaN
1  95.0   95  95.0
2   NaN  100   NaN

# group by

In [49]:
stock = {"C_name":["FB","Google","FB","Wipro","Google"],"Name":["Sai","Venkat","Santosh","Raj","Mahesh"],"Profit":[10000,2000,3000,5000,3000],"Loss":[200,500,700,650,100]}
stock

{'C_name': ['FB', 'Google', 'FB', 'Wipro', 'Google'],
 'Name': ['Sai', 'Venkat', 'Santosh', 'Raj', 'Mahesh'],
 'Profit': [10000, 2000, 3000, 5000, 3000],
 'Loss': [200, 500, 700, 650, 100]}

In [51]:
df=pd.DataFrame(stock) # created df stock and converted it into a dataframe
df

   C_name     Name  Profit  Loss
0      FB      Sai   10000   200
1  Google   Venkat    2000   500
2      FB  Santosh    3000   700
3   Wipro      Raj    5000   650
4  Google   Mahesh    3000   100

In [52]:
df.groupby('C_name') grouping by cname

In [53]:
grp_comp=df.groupby('C_name') #assigning it to some variable so that no need to use big syntax just that variable + method or operation to perform
grp_comp

In [54]:
grp_comp.mean() # mean

        Profit  Loss
C_name
FB        6500   450
Google    2500   300
Wipro     5000   650

In [55]:
grp_comp.std() #standard deviation

             Profit        Loss
C_name
FB      4949.747468  353.553391
Google   707.106781  282.842712
Wipro           NaN         NaN

In [56]:
grp_comp.min()

          Name  Profit  Loss
C_name
FB         Sai    3000   200
Google  Mahesh    2000   100
Wipro      Raj    5000   650

In [57]:
grp_comp.max()

           Name  Profit  Loss
C_name
FB      Santosh   10000   700
Google   Venkat    3000   500
Wipro       Raj    5000   650

In [58]:
grp_comp.count()

        Name  Profit  Loss
C_name
FB         2       2     2
Google     2       2     2
Wipro      1       1     1

In [59]:
grp_comp.describe() #describing the data by using groupby

       Profit                                                                \
        count    mean          std     min     25%     50%     75%      max
C_name
FB        2.0  6500.0  4949.747468  3000.0  4750.0  6500.0  8250.0  10000.0
Google    2.0  2500.0   707.106781  2000.0  2250.0  2500.0  2750.0   3000.0
Wipro     1.0  5000.0          NaN  5000.0  5000.0  5000.0  5000.0   5000.0

        Loss
       count   mean         std    min    25%    50%    75%    max
C_name
FB       2.0  450.0  353.553391  200.0  325.0  450.0  575.0  700.0
Google   2.0  300.0  282.842712  100.0  200.0  300.0  400.0  500.0
Wipro    1.0  650.0         NaN  650.0  650.0  650.0  650.0  650.0

In [60]:
grp_comp.describe().transpose() # interchanging rows into columns nad columns into rows

C_name                  FB       Google   Wipro
Profit count      2.000000     2.000000     1.0
       mean    6500.000000  2500.000000  5000.0
       std     4949.747468   707.106781     NaN
       min     3000.000000  2000.000000  5000.0
       25%     4750.000000  2250.000000  5000.0
       50%     6500.000000  2500.000000  5000.0
       75%     8250.000000  2750.000000  5000.0
       max    10000.000000  3000.000000  5000.0
Loss   count      2.000000     2.000000     1.0
       mean     450.000000   300.000000   650.0
       std      353.553391   282.842712     NaN
       min      200.000000   100.000000   650.0
       25%      325.000000   200.000000   650.0
       50%      450.000000   300.000000   650.0
       75%      575.000000   400.000000   650.0
       max      700.000000   500.000000   650.0

In [64]:
grp_comp.describe().transpose()['FB']

Profit  count        2.000000
        mean      6500.000000
        std       4949.747468
        min       3000.000000
        25%       4750.000000
        50%       6500.000000
        75%       8250.000000
        max      10000.000000
Loss    count        2.000000
        mean       450.000000
        std        353.553391
        min        200.000000
        25%        325.000000
        50%        450.000000
        75%        575.000000
        max        700.000000
Name: FB, dtype: float64

#  Merging, joining and concat

In [65]:
dafa1 = pd.DataFrame({'CustID': ['101', '102', '103', '104'],
                        'Sales': [13456, 45321, 54385, 53212],
                        'Priority': ['CAT0', 'CAT1', 'CAT2', 'CAT3'],
                        'Prime': ['yes', 'no', 'no', 'yes']},
                        index=[0, 1, 2, 3])

In [66]:
dafa2 = pd.DataFrame({'CustID': ['101', '103', '104', '105'],
                        'Sales': [13456, 54385, 53212, 4534],
                        'Payback': ['CAT4', 'CAT5', 'CAT6', 'CAT7'],
                        'Imp': ['yes', 'no', 'no', 'no']},
                         index=[0, 1, 2, 3])

In [67]:
dafa1

  CustID  Sales Priority Prime
0    101  13456     CAT0   yes
1    102  45321     CAT1    no
2    103  54385     CAT2    no
3    104  53212     CAT3   yes

In [68]:
dafa2

  CustID  Sales Payback  Imp
0    101  13456    CAT4  yes
1    103  54385    CAT5   no
2    104  53212    CAT6   no
3    105   4534    CAT7   no

In [69]:
pd.concat([dafa1,dafa2])

  CustID  Sales Priority Prime Payback  Imp
0    101  13456     CAT0   yes     NaN  NaN
1    102  45321     CAT1    no     NaN  NaN
2    103  54385     CAT2    no     NaN  NaN
3    104  53212     CAT3   yes     NaN  NaN
0    101  13456      NaN   NaN    CAT4  yes
1    103  54385      NaN   NaN    CAT5   no
2    104  53212      NaN   NaN    CAT6   no
3    105   4534      NaN   NaN    CAT7   no

In [70]:
pd.concat([dafa1,dafa2],axis=1)

  CustID  Sales Priority Prime CustID  Sales Payback  Imp
0    101  13456     CAT0   yes    101  13456    CAT4  yes
1    102  45321     CAT1    no    103  54385    CAT5   no
2    103  54385     CAT2    no    104  53212    CAT6   no
3    104  53212     CAT3   yes    105   4534    CAT7   no

# Merge  on basis of common columns

In [73]:
left = pd.DataFrame({ 'id':[1,2,3,4,5],
                     'Name':['Per1', 'Per2', 'Per3', 'Per4','Per5'],
                     'subject_id':['sub1','sub2','sub4','sub6','sub5']})

In [74]:
left

   id  Name subject_id
0   1  Per1       sub1
1   2  Per2       sub2
2   3  Per3       sub4
3   4  Per4       sub6
4   5  Per5       sub5

In [75]:
right = pd.DataFrame( {'id':[1,2,3,4,5],
        'Name': ['Per6', 'Per7', 'Per8', 'Per9','Per10'],
                'subject_id':['sub2','sub4','sub3','sub6','sub5']})

In [76]:
right

   id   Name subject_id
0   1   Per6       sub2
1   2   Per7       sub4
2   3   Per8       sub3
3   4   Per9       sub6
4   5  Per10       sub5

In [77]:
pd.merge(left,right, on = 'id',how = 'outer')

   id Name_x subject_id_x Name_y subject_id_y
0   1   Per1         sub1   Per6         sub2
1   2   Per2         sub2   Per7         sub4
2   3   Per3         sub4   Per8         sub3
3   4   Per4         sub6   Per9         sub6
4   5   Per5         sub5  Per10         sub5

In [78]:
pd.merge(left,right, on ='subject_id',how='inner')

   id_x Name_x subject_id  id_y Name_y
0     2   Per2       sub2     1   Per6
1     3   Per3       sub4     2   Per7
2     4   Per4       sub6     4   Per9
3     5   Per5       sub5     5  Per10

In [79]:
pd.merge(left,right,on = 'Name', how = 'left')

   id_x  Name subject_id_x  id_y subject_id_y
0     1  Per1         sub1   NaN          NaN
1     2  Per2         sub2   NaN          NaN
2     3  Per3         sub4   NaN          NaN
3     4  Per4         sub6   NaN          NaN
4     5  Per5         sub5   NaN          NaN

In [80]:
pd.merge(left,right,on = 'Name', how = 'right')

   id_x   Name subject_id_x  id_y subject_id_y
0   NaN   Per6          NaN     1         sub2
1   NaN   Per7          NaN     2         sub4
2   NaN   Per8          NaN     3         sub3
3   NaN   Per9          NaN     4         sub6
4   NaN  Per10          NaN     5         sub5

# Join will be done on basis of index

In [81]:
daf3 = pd.DataFrame({'Q1': ['101', '102', '103'],
                     'Q2': ['201', '202', '203']},
                      index=['I0', 'I1', 'I2'])

In [82]:
daf3

     Q1   Q2
I0  101  201
I1  102  202
I2  103  203

In [83]:
dafa4 = pd.DataFrame({'Q3': ['301', '302', '303'],
                    'Q4': ['401', '402', '403']},
                      index=['I0', 'I2', 'I3'])

In [84]:
dafa4

     Q3   Q4
I0  301  401
I2  302  402
I3  303  403

In [87]:
daf3.join(dafa4)

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I1  102  202  NaN  NaN
I2  103  203  302  402

In [88]:
dafa4.join(daf3)

     Q3   Q4   Q1   Q2
I0  301  401  101  201
I2  302  402  103  203
I3  303  403  NaN  NaN

# operations

In [89]:
dataframe = pd.DataFrame({'custID':[1,2,3,4],'SaleType':['big','small','medium','big'],'SalesCode':['121','131','141','151']})

In [90]:
dataframe

   custID SaleType SalesCode
0       1      big       121
1       2    small       131
2       3   medium       141
3       4      big       151

In [91]:
dataframe['SaleType'].unique()

array(['big', 'small', 'medium'], dtype=object)

In [92]:
dataframe['SaleType'].nunique()

3

In [94]:
dataframe['SaleType'].value_counts()

big       2
small     1
medium    1
Name: SaleType, dtype: int64

In [95]:
dataframe.loc[0].unique()

array([1, 'big', '121'], dtype=object)

In [96]:
dataframe.iloc[1].nunique()

3

# selecting data from dataframe using criteria of multiple columns

In [97]:
dataframe

   custID SaleType SalesCode
0       1      big       121
1       2    small       131
2       3   medium       141
3       4      big       151

In [102]:
newdataframe=dataframe[(dataframe['SaleType']!='big') & (dataframe['custID']!=2)]

In [103]:
newdataframe

   custID SaleType SalesCode
2       3   medium       141

In [104]:
def raise_n(a):
    return a**2

In [105]:
dataframe["custID"].apply(raise_n)

0     1
1     4
2     9
3    16
Name: custID, dtype: int64

In [106]:
dataframe['SaleType'].apply(len)

0    3
1    5
2    6
3    3
Name: SaleType, dtype: int64

In [107]:
del dataframe['custID']

In [108]:
dataframe

  SaleType SalesCode
0      big       121
1    small       131
2   medium       141
3      big       151

In [109]:
dataframe.columns

Index(['SaleType', 'SalesCode'], dtype='object')

In [110]:
dataframe.index

RangeIndex(start=0, stop=4, step=1)

In [111]:
dataframe.sort_values('SalesCode')

  SaleType SalesCode
0      big       121
1    small       131
2   medium       141
3      big       151

In [112]:
dataframe.sort_values('SaleType')

  SaleType SalesCode
0      big       121
3      big       151
2   medium       141
1    small       131

In [113]:
dataframe = pd.read_csv("E:\Top Mentor\mba.csv")

In [114]:
dataframe

     datasrno  workex  gmat      vaRIANCE  Unnamed: 4 Unnamed: 5  Unnamed: 6
0           1      21   720     78.069683         NaN        AVG  711.164295
1           2     107   640   5064.356883         NaN          N  773.000000
2           3      57   740    831.497883         NaN        NaN         NaN
3           4      99   690    447.927383         NaN        NaN         NaN
4           5     208   710      1.355583         NaN        NaN         NaN
..        ...     ...   ...           ...         ...        ...         ...
768       769      88   620   8310.928683         NaN        NaN         NaN
769       770     132   670   1694.499183         NaN        NaN         NaN
770       771      28   610  10234.214580         NaN        NaN         NaN
771       772      10   610  10234.214580         NaN        NaN         NaN
772       773      52   620   8310.928683         NaN        NaN         NaN

[773 rows x 7 columns]

In [115]:
dataframe.drop(['Unnamed: 4','Unnamed: 5','Unnamed: 6'],axis=1,inplace=True)

In [116]:
dataframe

     datasrno  workex  gmat      vaRIANCE
0           1      21   720     78.069683
1           2     107   640   5064.356883
2           3      57   740    831.497883
3           4      99   690    447.927383
4           5     208   710      1.355583
..        ...     ...   ...           ...
768       769      88   620   8310.928683
769       770     132   670   1694.499183
770       771      28   610  10234.214580
771       772      10   610  10234.214580
772       773      52   620   8310.928683

[773 rows x 4 columns]

In [117]:
dataframe.to_csv('train2.csv')

In [118]:
dataframe

     datasrno  workex  gmat      vaRIANCE
0           1      21   720     78.069683
1           2     107   640   5064.356883
2           3      57   740    831.497883
3           4      99   690    447.927383
4           5     208   710      1.355583
..        ...     ...   ...           ...
768       769      88   620   8310.928683
769       770     132   670   1694.499183
770       771      28   610  10234.214580
771       772      10   610  10234.214580
772       773      52   620   8310.928683

[773 rows x 4 columns]